Библиотека_электронных_документов_демо/src/Documents/_ДемоОперация/_ДемоОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ДемоОперация</name>
  <basedOn>Document._ДемоОперация</basedOn>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭД</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеЭД</name>
    <type>
      <types>EnumRef.НаправленияЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef._ДемоОперация</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef._ДемоОперация</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Documents/_ДемоЗаказПокупателя/_ДемоЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ДемоЗаказПокупателя</name>
  <basedOn>Document._ДемоЗаказПокупателя</basedOn>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПокупателя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._ДемоСтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef._ДемоЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСделки</name>
    <type>
      <types>DocumentRef._ДемоОперация</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef._ДемоСпособыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef._ДемоЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Documents/_ДемоОперация/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получение данных для формирования печатной формы заказа.
//
// Параметры:
//  ПараметрыПечати	 - ПараметрыМакетаТабличногоДокумента - параметры макета.
//  СсылкаНаОбъект	 - ДокументСсылка._ДемоЗаказПокупателя - ссылка на документ печати.
// 
// Возвращаемое значение:
//  Структура - структура данных для печати.
//
Функция ПолучитьДанныеДляПечатнойФормыЗаказ(ПараметрыПечати, СсылкаНаОбъект) Экспорт

	КолонкаКодов = "Код";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Наименование КАК Наименование,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Характеристика.Код КАК КодХарактеристики,
	|	Товары.Характеристика.Наименование КАК НаименованиеХарактеристики,
	|	Товары.Номенклатура.Код КАК Артикул,
	|	Товары.Номенклатура.Код КАК КодТовара,
	|	ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения.НаименованиеПолное КАК СТРОКА(3)) КАК Единица,
	|	Товары.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	НЕОПРЕДЕЛЕНО КАК ВидУпаковки,
	|	Товары.Количество КАК Количество,
	|	Товары.Количество КАК МассаНетто,
	|	Товары.Количество КАК МассаБрутто,
	|	Товары.Цена,
	|	Товары.Сумма КАК СуммаБезНДС,
	|	ЕСТЬNULL(Товары.Номенклатура.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)) КАК СтавкаНДС,
	|	Товары.Сумма * 18 / 100 КАК СуммаНДС,
	|	Товары.Сумма КАК СуммаСНДС,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(110)) КАК Ид,
	|	Товары.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	Товары.ЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	Товары.ЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	НЕОПРЕДЕЛЕНО КАК УпаковкаНаименование,
	|	1 КАК Коэффициент,
	|	НЕОПРЕДЕЛЕНО КАК УпаковкаКод,
	|	НЕОПРЕДЕЛЕНО КАК Упаковка,
	|	""2389473485348"" КАК ШтрихКод
	|ИЗ
	|	Документ._ДемоЗаказПокупателя.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ДемоЗаказПокупателя.Номер КАК Номер,
	|	_ДемоЗаказПокупателя.Дата КАК Дата,
	|	_ДемоЗаказПокупателя.Организация КАК Исполнитель,
	|	_ДемоЗаказПокупателя.Контрагент КАК Заказчик,
	|	_ДемоЗаказПокупателя.Контрагент КАК Грузополучатель,
	|	_ДемоЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	|	&ХозОперация КАК ХозОперация,
	|	&Роль КАК Роль,
	|	&Руководитель КАК Руководитель,
	|	&ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	&ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	&ДолжностьГлавногоБухгалтера КАК ДолжностьГлавногоБухгалтера,
	|	&Кладовщик КАК Кладовщик,
	|	&ДолжностьКладовщика КАК ДолжностьКладовщика,
	|	ИСТИНА КАК ЦенаВключаетНДС,
	|	_ДемоЗаказПокупателя.Валюта.Код КАК ВалютаКод,
	|	1 КАК Курс
	|ИЗ
	|	Документ._ДемоЗаказПокупателя КАК _ДемоЗаказПокупателя
	|ГДЕ
	|	_ДемоЗаказПокупателя.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка",                      СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ХозОперация",                 НСтр("ru = 'Заказ товара'"));
	Запрос.УстановитьПараметр("Роль",                        НСтр("ru = 'Продавец'"));
	Запрос.УстановитьПараметр("Руководитель",                НСтр("ru = 'Козлевич Адам Коземирович'"));
	Запрос.УстановитьПараметр("ДолжностьРуководителя",       НСтр("ru = 'Директор'"));
	Запрос.УстановитьПараметр("ГлавныйБухгалтер",            НСтр("ru = 'Синицкая Зося Викторовна'"));
	Запрос.УстановитьПараметр("ДолжностьГлавногоБухгалтера", НСтр("ru = 'Бухгалтер'"));
	Запрос.УстановитьПараметр("Кладовщик",                   НСтр("ru = 'Гайзенкамф Светлана Петровна'"));
	Запрос.УстановитьПараметр("ДолжностьКладовщика",         НСтр("ru = 'Кладовщик'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатПоТабличнойЧасти = МассивРезультатов[0];
	РезультатПоШапке = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
		РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

#КонецОбласти

#КонецЕсли
